app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "grace"], ["LIMIT", 1]]
---
  def create
    p "**************"
    @user = User.find_by(username: params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def finduser
    p "*************************************************"
    token = params[:token]
    p token
    decoded_id = custom_decode(token)[0]["user_id"]
    p decoded_id
    p "*************************************************"
    # if decoded_id
    #   render json: {user_id: decoded_id}, status: :accepted
    if decoded_id
      user = User.find_by(id: decoded_id)