app/controllers/teams_controller.rb

    def index
        teams = Team.all
---
SELECT "teams".* FROM "teams"

    def create
        # team = Team.find_or_create_by(team_params)
        team = Team.new(team_params)
        if team.save
---
INSERT INTO "teams" ("team_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["team_name", "The Lazy Boyz"], ["created_at", "2019-09-09 14:21:44.578604"], ["updated_at", "2019-09-09 14:21:44.578604"]]