app/controllers/user_teams_controller.rb

    def index
        userteams = UserTeam.all
---
SELECT "user_teams".* FROM "user_teams"

    def create
        userteam = UserTeam.new(userteam_params)
        if userteam.save
---
INSERT INTO "user_teams" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["team_id", 11], ["created_at", "2019-09-09 14:45:16.119922"], ["updated_at", "2019-09-09 14:45:16.119922"]]