app/controllers/users_controller.rb

    def create
        p "################"
        @user = User.new(username: params[:username], password: params[:password], img_url: params[:img_url], title: params[:title])
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "img_url", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"